
import sqlite3

db = sqlite3.connect('online_school.db')
sql = db.cursor()


sql.execute('DROP TABLE IF EXISTS students')
sql.execute('DROP TABLE IF EXISTS courses')
sql.execute('DROP TABLE IF EXISTS enrollments')

#  "Ученики"
sql.execute('''
CREATE TABLE students (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    age INTEGER
)''')

#  "Курсы"
sql.execute('''
CREATE TABLE courses (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    title TEXT,
    mentor TEXT
)''')

#  "Запись на курсы"
sql.execute('''
CREATE TABLE enrollments (
    id_order INTEGER PRIMARY KEY AUTOINCREMENT,
    id_student INTEGER,
    id_course INTEGER,
    start_date TEXT,
    end_date TEXT
)''')

#30 учеников
students_list = [
('Алексей',15),('Иван',16),('Мария',17),('Олег',18),('София',19),
('Дмитрий',15),('Анна',16),('Сергей',17),('Елена',18),('Максим',19),
('Артем',15),('Ольга',16),('Никита',17),('Татьяна',18),('Павел',19),
('Виктор',15),('Юлия',16),('Кирилл',17),('Дарья',18),('Роман',19),
('Егор',15),('Алина',16),('Игорь',17),('Наталья',18),('Степан',19),
('Валерия',15),('Георгий',16),('Людмила',17),('Константин',18),('Вероника',19)
]
sql.executemany('INSERT INTO students (name, age) VALUES (?, ?)', students_list)

# 30 курсов
courses_list = [
('Python для профи','Антон'),('Веб-дизайн','Артем'),
('Алгоритмы','Дональд Трамп'),('Data Science','Эндрю'),

('Python для профи','Антон'),('Веб-дизайн','Артем'),
('Алгоритмы','Дональд Трамп'),('Data Science','Эндрю'),

('Python для профи','Антон'),('Веб-дизайн','Артем'),
('Алгоритмы','Дональд Трамп'),('Data Science','Эндрю'),

('Python для профи','Антон'),('Веб-дизайн','Артем'),
('Алгоритмы','Дональд Трамп'),('Data Science','Эндрю'),

('Python для профи','Антон'),('Веб-дизайн','Артем'),
('Алгоритмы','Дональд Трамп'),('Data Science','Эндрю'),

('Python для профи','Антон'),('Веб-дизайн','Артем'),
('Алгоритмы','Дональд Трамп'),('Data Science','Эндрю'),

('Python для профи','Антон'),('Веб-дизайн','Артем'),
('Алгоритмы','Дональд Трамп'),('Data Science','Эндрю'),

('Python для профи','Антон'),('Веб-дизайн','Артем')
]
sql.executemany('INSERT INTO courses (title, mentor) VALUES (?, ?)', courses_list)


sql.execute('UPDATE courses SET id = id + 100')

#  записи
enrollments_list = [
(1,101,'01.09.2026','01.12.2026'),(2,102,'02.09.2026','02.12.2026'),
(3,103,'03.09.2026','03.12.2026'),(4,104,'04.09.2026','04.12.2026'),
(5,105,'05.09.2026','05.12.2026'),(6,106,'06.09.2026','06.12.2026'),
(7,107,'07.09.2026','07.12.2026'),(8,108,'08.09.2026','08.12.2026'),
(9,109,'09.09.2026','09.12.2026'),(10,110,'10.09.2026','10.12.2026'),
(11,111,'11.09.2026','11.12.2026'),(12,112,'12.09.2026','12.12.2026'),
(13,113,'13.09.2026','13.12.2026'),(14,114,'14.09.2026','14.12.2026'),
(15,115,'15.09.2026','15.12.2026'),(16,116,'16.09.2026','16.12.2026'),
(17,117,'17.09.2026','17.12.2026'),(18,118,'18.09.2026','18.12.2026'),
(19,119,'19.09.2026','19.12.2026'),(20,120,'20.09.2026','20.12.2026'),
(21,121,'21.09.2026','21.12.2026'),(22,122,'22.09.2026','22.12.2026'),
(23,123,'23.09.2026','23.12.2026'),(24,124,'24.09.2026','24.12.2026'),
(25,125,'25.09.2026','25.12.2026'),(26,126,'26.09.2026','26.12.2026'),
(27,127,'27.09.2026','27.12.2026'),(28,128,'28.09.2026','28.12.2026'),
(29,129,'29.09.2026','29.12.2026'),(30,130,'30.09.2026','30.12.2026')
]

sql.executemany(
    'INSERT INTO enrollments (id_student, id_course, start_date, end_date) VALUES (?, ?, ?, ?)',
    enrollments_list
)

db.commit()

print("Журнал записей:")
sql.execute('SELECT * FROM enrollments')
for row in sql.fetchall():
    print(row)

db.close()














